{
  "@context": "https://schema.org",
  "@type": "DefinedTermSet",
  "hasDefinedTerm": [
    {
      "@type": "DefinedTerm",
      "name": "Energy–Flow Cosmology v1.2: Foundational Framework and Cross-Field Continuity",
      "description": "<p dir=\"ltr\">This preprint presents Energy-Flow Cosmology (EFC v1.2), a covariant non-equilibrium thermodynamic framework extending General Relativity. </p><p dir=\"ltr\">A scalar energy-flow potential Ef governs entropy-driven organization and spacetime curvature. The model reduces to GR at equilibrium and reproduces key cosmological phenomena without dark-matter or dark-energy postulates. </p><p dir=\"ltr\">Mathematical consistency is shown through Lyapunov stability and Bayesian no-go tests, and an explicit bridge to the Free Energy Principle establishes cross-field continuity between physics, ",
      "@id": "https://energyflow-cosmology.com/concepts/energy–flow-cosmology-v1.2:-foundational-framework-and-cross-field-continuity",
      "identifier": "",
      "url": "",
      "creator": {
        "@type": "Person",
        "name": "Morten Magnusson",
        "sameAs": "https://orcid.org/0009-0002-4860-5095"
      }
    },
    {
      "@type": "DefinedTerm",
      "name": "Energy-Flow Cosmology (EFC-v2.1): Unified Thermodynamic Framework across Structure, Dynamics, and Cognition",
      "description": "<p dir=\"ltr\"><b>Energy-Flow Cosmology (EFC v2.1)</b> is a unified thermodynamic framework in which a continuous energy–entropy flow field generates the structure, dynamics, and cognition of the Universe.<br>Matter, spacetime, and awareness are treated as localized modes of an underlying energy-flow continuum operating between two thermodynamic boundaries: <b>S = 0</b> (perfect order, the Singularity) and <b>S = 1</b> (maximal entropy, the Altular limit).</p><p dir=\"ltr\"><br></p><p dir=\"ltr\">The <b>Complete Edition (v2A)</b> consolidates all DOI-anchored modules published between 2024 and 2025 ",
      "@id": "https://energyflow-cosmology.com/concepts/energy-flow-cosmology-(efc-v2.1):-unified-thermodynamic-framework-across-structure,-dynamics,-and-cognition",
      "identifier": "",
      "url": "",
      "creator": {
        "@type": "Person",
        "name": "Morten Magnusson",
        "sameAs": "https://orcid.org/0009-0002-4860-5095"
      }
    },
    {
      "@type": "DefinedTerm",
      "name": "Applied Energy-Flow Cosmology v2.2 – Cross-Field Integration Summary (2025)",
      "description": "<p dir=\"ltr\">This research note summarizes the applied layer of Energy-Flow Cosmology (EFC), a thermodynamic framework linking cosmology, biology, artificial intelligence, and economics. </p><p dir=\"ltr\">EFC treats energy flow and entropy as universal variables governing the emergence and stability of complex systems. The framework integrates non-equilibrium thermodynamics (Prigogine, Haken), energy-rate density (Chaisson), and informational adaptation (Friston) into a cross-field analytic model. </p><p dir=\"ltr\">It introduces the concept of an adaptive energy-flow window and formulates a test",
      "@id": "https://energyflow-cosmology.com/concepts/applied-energy-flow-cosmology-v2.2-–-cross-field-integration-summary-(2025)",
      "identifier": "",
      "url": "",
      "creator": {
        "@type": "Person",
        "name": "Morten Magnusson",
        "sameAs": "https://orcid.org/0009-0002-4860-5095"
      }
    },
    {
      "@type": "DefinedTerm",
      "name": "CEM-Cosmos: A Field-Theoretic Model of ConsciousnessCoupled to Energy-Flow Cosmology",
      "description": "<p dir=\"ltr\">This preprint presents <i>CEM-Cosmos</i>, a theoretical framework unifying cosmology, psychology, and artificial intelligence through thermodynamic principles. The model extends the Energy-Flow Model (EFM) by introducing <i>Consciousness as an Energy-Modulated field</i> (C-field), where interior awareness arises as resonance in non-equilibrium energy gradients. Ego is modeled as a local entropy minimum stabilizing identity, while the mirror term formalizes recursive feedback enabling self-modeling. A dimensionless reflection coefficient <i>R</i> governs this process, with a critic",
      "@id": "https://energyflow-cosmology.com/concepts/cem-cosmos:-a-field-theoretic-model-of-consciousnesscoupled-to-energy-flow-cosmology",
      "identifier": "",
      "url": "",
      "creator": {
        "@type": "Person",
        "name": "Morten Magnusson",
        "sameAs": "https://orcid.org/0009-0002-4860-5095"
      }
    }
  ]
}